ubuntu/Linux.org
#+TITLE Linux Config

* 64位系统运行32位的程序
  * 需要安装ia32-libs库
#+BEGIN_SRC bash
    sudo apt-get install ia32-libs
#+END_SRC

* 分辨率设置(Resolution)
  * 查看显卡
#+BEGIN_SRC bash
    border@b0rder:~$ lspci | grep VGA
    00:02.0 VGA compatible controller: Intel Corporation 2nd Generation Core Processor Family Integrated Graphics Controller (rev 09)
    border@b0rder:~$ sudo apt-get install xresprobe
    border@b0rder:~$ sudo ddcprobe 
    [sudo] password for border: 
    vbe: VESA 3.0 detected.
    oem: Intel(R)Sandybridge Desktop Graphics Chipset Accelerated VGA BIOS
    vendor: Intel Corporation
    product: Intel(R)Sandybridge Desktop Graphics Controller Hardware Version 0.0
    memory: 65472kb
    mode: 1280x1024x256
    mode: 1280x1024x64k
    mode: 1280x1024x16m
    mode: 1024x768x256
    mode: 1024x768x64k
    mode: 1024x768x16m
    mode: 640x480x16m
    mode: 800x600x64k
    mode: 800x600x16m
    mode: 640x480x256
    mode: 800x600x256
    mode: 640x480x64k

    border@b0rder:~$ cvt 1280 1024
    # 1280x1024 59.89 Hz (CVT 1.31M4) hsync: 63.67 kHz; pclk: 109.00 MHz
    Modeline "1280x1024_60.00"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync

    border@b0rder:~$ xrandr --newmode "1280x1024_60.00"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync

    border@b0rder:~$ xrandr --addmode VGA1 "1280x1024_60.00"
#+END_SRC
  * 
  * 参考:
    * [[https://wiki.ubuntu.com/X/Config/Resolution][Resolution]]
    * [[http://www.grenage.com/xorg.html][Xorg.conf and incorrect resolution detection]]
