ubuntu/Linux.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml"
lang="en" xml:lang="en">
<head>
<title>Linux</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2011-07-25 15:01:31 CST"/>
<meta name="author" content="border"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
</head>
<body>
<div id="content">

<h1 class="title">Linux</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 64位系统运行32位的程序 </a></li>
<li><a href="#sec-2">2 分辨率设置(Resolution) </a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 64位系统运行32位的程序 </h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>
需要安装ia32-libs库

</li>
</ul>


<pre class="example">sudo apt-get install ia32-libs
</pre>




</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 分辨率设置(Resolution) </h2>
<div class="outline-text-2" id="text-2">

<ul>
<li>
查看显卡

</li>
</ul>


<pre class="example">    border@b0rder:~$ lspci | grep VGA
00:02.0 VGA compatible controller: Intel Corporation 2nd Generation Core Processor Family Integrated Graphics Controller (rev 09)
    border@b0rder:~$ sudo apt-get install xresprobe
    border@b0rder:~$ sudo ddcprobe 
[sudo] password for border: 
vbe: VESA 3.0 detected.
oem: Intel(R)Sandybridge Desktop Graphics Chipset Accelerated VGA BIOS
vendor: Intel Corporation
product: Intel(R)Sandybridge Desktop Graphics Controller Hardware Version 0.0
memory: 65472kb
mode: 1280x1024x256
mode: 1280x1024x64k
mode: 1280x1024x16m
mode: 1024x768x256
mode: 1024x768x64k
mode: 1024x768x16m
mode: 640x480x16m
mode: 800x600x64k
mode: 800x600x16m
mode: 640x480x256
mode: 800x600x256
mode: 640x480x64k

   border@b0rder:~$ cvt 1280 1024
# 1280x1024 59.89 Hz (CVT 1.31M4) hsync: 63.67 kHz; pclk: 109.00 MHz
Modeline "1280x1024_60.00"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync

   xrandr --newmode "1280x1024_60.00"  109.00  1280 1368 1496 1712  1024 1027 1034 1063 -hsync +vsync

   xrandr --addmode VGA1 "1280x1024_60.00"
</pre>



<ul>
<li>
参考:
<ul>
<li>
<a href="https://wiki.ubuntu.com/X/Config/Resolution">Resolution</a>
</li>
<li>
<a href="http://www.grenage.com/xorg.html">Xorg.conf and incorrect resolution detection</a>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="postamble">
<p class="author"> Author: border
<a href="mailto:border@b0rder">&lt;border@b0rder&gt;</a>
</p>
<p class="date"> Date: 2011-07-25 15:01:31 CST</p>
<p class="creator">HTML generated by org-mode 6.33x in emacs 23</p>
</div>
</div>
</body>
</html>
